; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-60)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
	person34 - person
	person35 - person
	person36 - person
	person37 - person
	person38 - person
	person39 - person
	person40 - person
	person41 - person
	person42 - person
	person43 - person
	person44 - person
	person45 - person
	person46 - person
	person47 - person
	person48 - person
	person49 - person
	person50 - person
	person51 - person
	person52 - person
	person53 - person
	person54 - person
	person55 - person
	person56 - person
	person57 - person
	person58 - person
	person59 - person
	person60 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city7)
	(fuel-level plane1 fl6)
	(at_aircraft plane2 city8)
	(fuel-level plane2 fl6)
	(at_aircraft plane3 city6)
	(fuel-level plane3 fl4)
	(at_aircraft plane4 city2)
	(fuel-level plane4 fl5)
	(at_aircraft plane5 city7)
	(fuel-level plane5 fl4)
	(at person1 city3)
	(at person2 city4)
	(at person3 city8)
	(at person4 city0)
	(at person5 city3)
	(at person6 city6)
	(at person7 city8)
	(at person8 city3)
	(at person9 city5)
	(at person10 city9)
	(at person11 city2)
	(at person12 city3)
	(at person13 city5)
	(at person14 city1)
	(at person15 city7)
	(at person16 city6)
	(at person17 city2)
	(at person18 city5)
	(at person19 city7)
	(at person20 city3)
	(at person21 city1)
	(at person22 city8)
	(at person23 city0)
	(at person24 city6)
	(at person25 city0)
	(at person26 city9)
	(at person27 city0)
	(at person28 city3)
	(at person29 city8)
	(at person30 city6)
	(at person31 city8)
	(at person32 city8)
	(at person33 city9)
	(at person34 city0)
	(at person35 city2)
	(at person36 city9)
	(at person37 city7)
	(at person38 city5)
	(at person39 city6)
	(at person40 city6)
	(at person41 city4)
	(at person42 city2)
	(at person43 city4)
	(at person44 city4)
	(at person45 city5)
	(at person46 city5)
	(at person47 city0)
	(at person48 city3)
	(at person49 city9)
	(at person50 city5)
	(at person51 city6)
	(at person52 city2)
	(at person53 city2)
	(at person54 city7)
	(at person55 city3)
	(at person56 city0)
	(at person57 city8)
	(at person58 city8)
	(at person59 city3)
	(at person60 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at_aircraft plane2 city4)
	(at person1 city0)
	(at person2 city3)
	(at person3 city4)
	(at person4 city8)
	(at person5 city4)
	(at person6 city1)
	(at person7 city2)
	(at person8 city1)
	(at person9 city3)
	(at person10 city4)
	(at person11 city7)
	(at person12 city1)
	(at person13 city9)
	(at person14 city0)
	(at person15 city4)
	(at person16 city1)
	(at person17 city9)
	(at person18 city3)
	(at person19 city8)
	(at person20 city7)
	(at person21 city0)
	(at person22 city3)
	(at person23 city8)
	(at person24 city0)
	(at person25 city8)
	(at person26 city5)
	(at person27 city7)
	(at person28 city3)
	(at person29 city0)
	(at person30 city4)
	(at person31 city5)
	(at person32 city4)
	(at person33 city4)
	(at person34 city0)
	(at person35 city1)
	(at person36 city1)
	(at person37 city1)
	(at person38 city5)
	(at person39 city3)
	(at person40 city0)
	(at person41 city9)
	(at person42 city7)
	(at person43 city7)
	(at person44 city8)
	(at person45 city1)
	(at person46 city1)
	(at person47 city9)
	(at person48 city4)
	(at person49 city1)
	(at person50 city8)
	(at person51 city3)
	(at person52 city5)
	(at person53 city9)
	(at person54 city4)
	(at person55 city0)
	(at person56 city5)
	(at person57 city6)
	(at person59 city8)
	(at person60 city3)
	))

)

; plan
1. (fly plane5 city7 city2 fl4 fl3)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl4)
   added: (at_aircraft plane5 city2) (fuel-level plane5 fl3)
   goals met: 3 of 60
2. (board person60 plane5 city2)
   deleted: (at person60 city2)
   added: (in person60 plane5)
   goals met: 3 of 60
3. (board person53 plane5 city2)
   deleted: (at person53 city2)
   added: (in person53 plane5)
   goals met: 3 of 60
4. (board person52 plane5 city2)
   deleted: (at person52 city2)
   added: (in person52 plane5)
   goals met: 3 of 60
5. (board person42 plane5 city2)
   deleted: (at person42 city2)
   added: (in person42 plane5)
   goals met: 3 of 60
6. (board person35 plane5 city2)
   deleted: (at person35 city2)
   added: (in person35 plane5)
   goals met: 3 of 60
7. (board person17 plane5 city2)
   deleted: (at person17 city2)
   added: (in person17 plane5)
   goals met: 3 of 60
8. (board person11 plane5 city2)
   deleted: (at person11 city2)
   added: (in person11 plane5)
   goals met: 3 of 60
9. (board person6 plane3 city6)
   deleted: (at person6 city6)
   added: (in person6 plane3)
   goals met: 3 of 60
10. (board person51 plane3 city6)
   deleted: (at person51 city6)
   added: (in person51 plane3)
   goals met: 3 of 60
11. (board person40 plane3 city6)
   deleted: (at person40 city6)
   added: (in person40 plane3)
   goals met: 3 of 60
12. (board person39 plane3 city6)
   deleted: (at person39 city6)
   added: (in person39 plane3)
   goals met: 3 of 60
13. (board person30 plane3 city6)
   deleted: (at person30 city6)
   added: (in person30 plane3)
   goals met: 3 of 60
14. (board person24 plane3 city6)
   deleted: (at person24 city6)
   added: (in person24 plane3)
   goals met: 3 of 60
15. (board person16 plane3 city6)
   deleted: (at person16 city6)
   added: (in person16 plane3)
   goals met: 3 of 60
16. (fly plane2 city8 city2 fl6 fl5)
   deleted: (at_aircraft plane2 city8) (fuel-level plane2 fl6)
   added: (at_aircraft plane2 city2) (fuel-level plane2 fl5)
   goals met: 3 of 60
17. (board person54 plane1 city7)
   deleted: (at person54 city7)
   added: (in person54 plane1)
   goals met: 3 of 60
18. (board person37 plane1 city7)
   deleted: (at person37 city7)
   added: (in person37 plane1)
   goals met: 3 of 60
19. (board person19 plane1 city7)
   deleted: (at person19 city7)
   added: (in person19 plane1)
   goals met: 3 of 60
20. (board person15 plane1 city7)
   deleted: (at person15 city7)
   added: (in person15 plane1)
   goals met: 3 of 60
21. (fly plane5 city2 city7 fl3 fl2)
   deleted: (at_aircraft plane5 city2) (fuel-level plane5 fl3)
   added: (at_aircraft plane5 city7) (fuel-level plane5 fl2)
   goals met: 3 of 60
22. (debark person42 plane5 city7)
   deleted: (in person42 plane5)
   added: (at person42 city7)
   goals met: 4 of 60
23. (debark person11 plane5 city7)
   deleted: (in person11 plane5)
   added: (at person11 city7)
   goals met: 5 of 60
24. (fly plane5 city7 city1 fl2 fl1)
   deleted: (at_aircraft plane5 city7) (fuel-level plane5 fl2)
   added: (at_aircraft plane5 city1) (fuel-level plane5 fl1)
   goals met: 5 of 60
25. (debark person35 plane5 city1)
   deleted: (in person35 plane5)
   added: (at person35 city1)
   goals met: 6 of 60
26. (fly plane5 city1 city3 fl1 fl0)
   deleted: (at_aircraft plane5 city1) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city3) (fuel-level plane5 fl0)
   goals met: 6 of 60
27. (debark person60 plane5 city3)
   deleted: (in person60 plane5)
   added: (at person60 city3)
   goals met: 7 of 60
28. (fly plane1 city7 city0 fl6 fl5)
   deleted: (at_aircraft plane1 city7) (fuel-level plane1 fl6)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl5)
   goals met: 7 of 60
29. (board person56 plane1 city0)
   deleted: (at person56 city0)
   added: (in person56 plane1)
   goals met: 7 of 60
30. (board person47 plane1 city0)
   deleted: (at person47 city0)
   added: (in person47 plane1)
   goals met: 7 of 60
31. (board person4 plane1 city0)
   deleted: (at person4 city0)
   added: (in person4 plane1)
   goals met: 7 of 60
32. (board person27 plane1 city0)
   deleted: (at person27 city0)
   added: (in person27 plane1)
   goals met: 7 of 60
33. (board person25 plane1 city0)
   deleted: (at person25 city0)
   added: (in person25 plane1)
   goals met: 7 of 60
34. (board person23 plane1 city0)
   deleted: (at person23 city0)
   added: (in person23 plane1)
   goals met: 7 of 60
35. (fly plane3 city6 city0 fl4 fl3)
   deleted: (at_aircraft plane3 city6) (fuel-level plane3 fl4)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl3)
   goals met: 7 of 60
36. (debark person40 plane3 city0)
   deleted: (in person40 plane3)
   added: (at person40 city0)
   goals met: 8 of 60
37. (debark person24 plane3 city0)
   deleted: (in person24 plane3)
   added: (at person24 city0)
   goals met: 9 of 60
38. (fly plane1 city0 city4 fl5 fl4)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl5)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl4)
   goals met: 9 of 60
39. (debark person54 plane1 city4)
   deleted: (in person54 plane1)
   added: (at person54 city4)
   goals met: 10 of 60
40. (board person44 plane1 city4)
   deleted: (at person44 city4)
   added: (in person44 plane1)
   goals met: 10 of 60
41. (board person43 plane1 city4)
   deleted: (at person43 city4)
   added: (in person43 plane1)
   goals met: 10 of 60
42. (board person41 plane1 city4)
   deleted: (at person41 city4)
   added: (in person41 plane1)
   goals met: 10 of 60
43. (fly plane3 city0 city4 fl3 fl2)
   deleted: (at_aircraft plane3 city0) (fuel-level plane3 fl3)
   added: (at_aircraft plane3 city4) (fuel-level plane3 fl2)
   goals met: 10 of 60
44. (debark person30 plane3 city4)
   deleted: (in person30 plane3)
   added: (at person30 city4)
   goals met: 11 of 60
45. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   goals met: 11 of 60
46. (fly plane2 city2 city4 fl5 fl4)
   deleted: (at_aircraft plane2 city2) (fuel-level plane2 fl5)
   added: (at_aircraft plane2 city4) (fuel-level plane2 fl4)
   goals met: 12 of 60
47. (debark person15 plane1 city4)
   deleted: (in person15 plane1)
   added: (at person15 city4)
   goals met: 13 of 60
48. (fly plane3 city4 city1 fl2 fl1)
   deleted: (at_aircraft plane3 city4) (fuel-level plane3 fl2)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   goals met: 13 of 60
49. (fly plane3 city1 city0 fl1 fl0)
   deleted: (at_aircraft plane3 city1) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city0) (fuel-level plane3 fl0)
   goals met: 13 of 60
50. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 13 of 60
51. (fly plane3 city0 city3 fl1 fl0)
   deleted: (at_aircraft plane3 city0) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city3) (fuel-level plane3 fl0)
   goals met: 13 of 60
52. (debark person51 plane3 city3)
   deleted: (in person51 plane3)
   added: (at person51 city3)
   goals met: 14 of 60
53. (debark person39 plane3 city3)
   deleted: (in person39 plane3)
   added: (at person39 city3)
   goals met: 15 of 60
54. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   goals met: 16 of 60
55. (fly plane1 city4 city1 fl4 fl3)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl4)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl3)
   goals met: 16 of 60
56. (debark person37 plane1 city1)
   deleted: (in person37 plane1)
   added: (at person37 city1)
   goals met: 17 of 60
57. (board person21 plane1 city1)
   deleted: (at person21 city1)
   added: (in person21 plane1)
   goals met: 17 of 60
58. (board person14 plane1 city1)
   deleted: (at person14 city1)
   added: (in person14 plane1)
   goals met: 17 of 60
59. (fly plane1 city1 city0 fl3 fl2)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl3)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl2)
   goals met: 17 of 60
60. (debark person21 plane1 city0)
   deleted: (in person21 plane1)
   added: (at person21 city0)
   goals met: 18 of 60
61. (debark person14 plane1 city0)
   deleted: (in person14 plane1)
   added: (at person14 city0)
   goals met: 19 of 60
62. (fly plane1 city0 city3 fl2 fl1)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl2)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   goals met: 19 of 60
63. (board person8 plane1 city3)
   deleted: (at person8 city3)
   added: (in person8 plane1)
   goals met: 19 of 60
64. (board person59 plane1 city3)
   deleted: (at person59 city3)
   added: (in person59 plane1)
   goals met: 19 of 60
65. (board person55 plane1 city3)
   deleted: (at person55 city3)
   added: (in person55 plane1)
   goals met: 19 of 60
66. (board person5 plane1 city3)
   deleted: (at person5 city3)
   added: (in person5 plane1)
   goals met: 19 of 60
67. (board person48 plane1 city3)
   deleted: (at person48 city3)
   added: (in person48 plane1)
   goals met: 19 of 60
68. (board person20 plane1 city3)
   deleted: (at person20 city3)
   added: (in person20 plane1)
   goals met: 19 of 60
69. (board person12 plane1 city3)
   deleted: (at person12 city3)
   added: (in person12 plane1)
   goals met: 19 of 60
70. (board person1 plane1 city3)
   deleted: (at person1 city3)
   added: (in person1 plane1)
   goals met: 19 of 60
71. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 19 of 60
72. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 19 of 60
73. (fly plane3 city3 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city3) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 19 of 60
74. (debark person6 plane3 city1)
   deleted: (in person6 plane3)
   added: (at person6 city1)
   goals met: 20 of 60
75. (debark person16 plane3 city1)
   deleted: (in person16 plane3)
   added: (at person16 city1)
   goals met: 21 of 60
76. (fly plane5 city3 city9 fl1 fl0)
   deleted: (at_aircraft plane5 city3) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city9) (fuel-level plane5 fl0)
   goals met: 21 of 60
77. (debark person53 plane5 city9)
   deleted: (in person53 plane5)
   added: (at person53 city9)
   goals met: 22 of 60
78. (debark person17 plane5 city9)
   deleted: (in person17 plane5)
   added: (at person17 city9)
   goals met: 23 of 60
79. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 23 of 60
80. (fly plane5 city9 city5 fl1 fl0)
   deleted: (at_aircraft plane5 city9) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city5) (fuel-level plane5 fl0)
   goals met: 23 of 60
81. (debark person52 plane5 city5)
   deleted: (in person52 plane5)
   added: (at person52 city5)
   goals met: 24 of 60
82. (fly plane2 city4 city9 fl4 fl3)
   deleted: (at_aircraft plane2 city4) (fuel-level plane2 fl4)
   added: (at_aircraft plane2 city9) (fuel-level plane2 fl3)
   goals met: 23 of 60
83. (board person49 plane2 city9)
   deleted: (at person49 city9)
   added: (in person49 plane2)
   goals met: 23 of 60
84. (board person36 plane2 city9)
   deleted: (at person36 city9)
   added: (in person36 plane2)
   goals met: 23 of 60
85. (fly plane2 city9 city1 fl3 fl2)
   deleted: (at_aircraft plane2 city9) (fuel-level plane2 fl3)
   added: (at_aircraft plane2 city1) (fuel-level plane2 fl2)
   goals met: 23 of 60
86. (debark person49 plane2 city1)
   deleted: (in person49 plane2)
   added: (at person49 city1)
   goals met: 24 of 60
87. (debark person36 plane2 city1)
   deleted: (in person36 plane2)
   added: (at person36 city1)
   goals met: 25 of 60
88. (fly plane2 city1 city4 fl2 fl1)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl2)
   added: (at_aircraft plane2 city4) (fuel-level plane2 fl1)
   goals met: 26 of 60
89. (fly plane2 city4 city9 fl1 fl0)
   deleted: (at_aircraft plane2 city4) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city9) (fuel-level plane2 fl0)
   goals met: 25 of 60
90. (refuel plane2 city9 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 25 of 60
91. (board person33 plane2 city9)
   deleted: (at person33 city9)
   added: (in person33 plane2)
   goals met: 25 of 60
92. (board person26 plane2 city9)
   deleted: (at person26 city9)
   added: (in person26 plane2)
   goals met: 25 of 60
93. (board person10 plane2 city9)
   deleted: (at person10 city9)
   added: (in person10 plane2)
   goals met: 25 of 60
94. (fly plane2 city9 city4 fl1 fl0)
   deleted: (at_aircraft plane2 city9) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city4) (fuel-level plane2 fl0)
   goals met: 26 of 60
95. (debark person33 plane2 city4)
   deleted: (in person33 plane2)
   added: (at person33 city4)
   goals met: 27 of 60
96. (debark person10 plane2 city4)
   deleted: (in person10 plane2)
   added: (at person10 city4)
   goals met: 28 of 60
97. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 28 of 60
98. (fly plane2 city4 city5 fl1 fl0)
   deleted: (at_aircraft plane2 city4) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city5) (fuel-level plane2 fl0)
   goals met: 27 of 60
99. (debark person26 plane2 city5)
   deleted: (in person26 plane2)
   added: (at person26 city5)
   goals met: 28 of 60
100. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 28 of 60
101. (fly plane2 city5 city1 fl1 fl0)
   deleted: (at_aircraft plane2 city5) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city1) (fuel-level plane2 fl0)
   goals met: 28 of 60
102. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 28 of 60
103. (fly plane2 city1 city4 fl1 fl0)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city4) (fuel-level plane2 fl0)
   goals met: 29 of 60
104. (fly plane4 city2 city8 fl5 fl4)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl5)
   added: (at_aircraft plane4 city8) (fuel-level plane4 fl4)
   goals met: 29 of 60
105. (board person7 plane4 city8)
   deleted: (at person7 city8)
   added: (in person7 plane4)
   goals met: 29 of 60
106. (board person57 plane4 city8)
   deleted: (at person57 city8)
   added: (in person57 plane4)
   goals met: 29 of 60
107. (fly plane4 city8 city0 fl4 fl3)
   deleted: (at_aircraft plane4 city8) (fuel-level plane4 fl4)
   added: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   goals met: 29 of 60
108. (fly plane4 city0 city2 fl3 fl2)
   deleted: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   goals met: 29 of 60
109. (debark person7 plane4 city2)
   deleted: (in person7 plane4)
   added: (at person7 city2)
   goals met: 30 of 60
110. (fly plane4 city2 city6 fl2 fl1)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   added: (at_aircraft plane4 city6) (fuel-level plane4 fl1)
   goals met: 30 of 60
111. (debark person57 plane4 city6)
   deleted: (in person57 plane4)
   added: (at person57 city6)
   goals met: 31 of 60
112. (fly plane1 city3 city5 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city5) (fuel-level plane1 fl0)
   goals met: 31 of 60
113. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 31 of 60
114. (board person9 plane1 city5)
   deleted: (at person9 city5)
   added: (in person9 plane1)
   goals met: 31 of 60
115. (debark person56 plane1 city5)
   deleted: (in person56 plane1)
   added: (at person56 city5)
   goals met: 32 of 60
116. (board person50 plane1 city5)
   deleted: (at person50 city5)
   added: (in person50 plane1)
   goals met: 32 of 60
117. (board person46 plane1 city5)
   deleted: (at person46 city5)
   added: (in person46 plane1)
   goals met: 32 of 60
118. (board person45 plane1 city5)
   deleted: (at person45 city5)
   added: (in person45 plane1)
   goals met: 32 of 60
119. (board person18 plane1 city5)
   deleted: (at person18 city5)
   added: (in person18 plane1)
   goals met: 32 of 60
120. (board person13 plane1 city5)
   deleted: (at person13 city5)
   added: (in person13 plane1)
   goals met: 32 of 60
121. (fly plane1 city5 city8 fl1 fl0)
   deleted: (at_aircraft plane1 city5) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city8) (fuel-level plane1 fl0)
   goals met: 32 of 60
122. (refuel plane1 city8 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 32 of 60
123. (debark person59 plane1 city8)
   deleted: (in person59 plane1)
   added: (at person59 city8)
   goals met: 33 of 60
124. (debark person50 plane1 city8)
   deleted: (in person50 plane1)
   added: (at person50 city8)
   goals met: 34 of 60
125. (debark person44 plane1 city8)
   deleted: (in person44 plane1)
   added: (at person44 city8)
   goals met: 35 of 60
126. (debark person4 plane1 city8)
   deleted: (in person4 plane1)
   added: (at person4 city8)
   goals met: 36 of 60
127. (board person32 plane1 city8)
   deleted: (at person32 city8)
   added: (in person32 plane1)
   goals met: 36 of 60
128. (board person31 plane1 city8)
   deleted: (at person31 city8)
   added: (in person31 plane1)
   goals met: 36 of 60
129. (board person3 plane1 city8)
   deleted: (at person3 city8)
   added: (in person3 plane1)
   goals met: 36 of 60
130. (board person29 plane1 city8)
   deleted: (at person29 city8)
   added: (in person29 plane1)
   goals met: 36 of 60
131. (debark person25 plane1 city8)
   deleted: (in person25 plane1)
   added: (at person25 city8)
   goals met: 37 of 60
132. (debark person23 plane1 city8)
   deleted: (in person23 plane1)
   added: (at person23 city8)
   goals met: 38 of 60
133. (board person22 plane1 city8)
   deleted: (at person22 city8)
   added: (in person22 plane1)
   goals met: 38 of 60
134. (debark person19 plane1 city8)
   deleted: (in person19 plane1)
   added: (at person19 city8)
   goals met: 39 of 60
135. (fly plane1 city8 city0 fl1 fl0)
   deleted: (at_aircraft plane1 city8) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city0) (fuel-level plane1 fl0)
   goals met: 39 of 60
136. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 39 of 60
137. (debark person55 plane1 city0)
   deleted: (in person55 plane1)
   added: (at person55 city0)
   goals met: 40 of 60
138. (debark person29 plane1 city0)
   deleted: (in person29 plane1)
   added: (at person29 city0)
   goals met: 41 of 60
139. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   goals met: 42 of 60
140. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at_aircraft plane1 city0) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city1) (fuel-level plane1 fl0)
   goals met: 42 of 60
141. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 42 of 60
142. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   goals met: 43 of 60
143. (debark person46 plane1 city1)
   deleted: (in person46 plane1)
   added: (at person46 city1)
   goals met: 44 of 60
144. (debark person45 plane1 city1)
   deleted: (in person45 plane1)
   added: (at person45 city1)
   goals met: 45 of 60
145. (debark person12 plane1 city1)
   deleted: (in person12 plane1)
   added: (at person12 city1)
   goals met: 46 of 60
146. (fly plane1 city1 city3 fl1 fl0)
   deleted: (at_aircraft plane1 city1) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city3) (fuel-level plane1 fl0)
   goals met: 46 of 60
147. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 46 of 60
148. (debark person9 plane1 city3)
   deleted: (in person9 plane1)
   added: (at person9 city3)
   goals met: 47 of 60
149. (debark person22 plane1 city3)
   deleted: (in person22 plane1)
   added: (at person22 city3)
   goals met: 48 of 60
150. (debark person18 plane1 city3)
   deleted: (in person18 plane1)
   added: (at person18 city3)
   goals met: 49 of 60
151. (fly plane1 city3 city4 fl1 fl0)
   deleted: (at_aircraft plane1 city3) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city4) (fuel-level plane1 fl0)
   goals met: 49 of 60
152. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 49 of 60
153. (debark person5 plane1 city4)
   deleted: (in person5 plane1)
   added: (at person5 city4)
   goals met: 50 of 60
154. (debark person48 plane1 city4)
   deleted: (in person48 plane1)
   added: (at person48 city4)
   goals met: 51 of 60
155. (debark person32 plane1 city4)
   deleted: (in person32 plane1)
   added: (at person32 city4)
   goals met: 52 of 60
156. (debark person3 plane1 city4)
   deleted: (in person3 plane1)
   added: (at person3 city4)
   goals met: 53 of 60
157. (fly plane1 city4 city5 fl1 fl0)
   deleted: (at_aircraft plane1 city4) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city5) (fuel-level plane1 fl0)
   goals met: 53 of 60
158. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 53 of 60
159. (debark person31 plane1 city5)
   deleted: (in person31 plane1)
   added: (at person31 city5)
   goals met: 54 of 60
160. (fly plane1 city5 city7 fl1 fl0)
   deleted: (at_aircraft plane1 city5) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city7) (fuel-level plane1 fl0)
   goals met: 54 of 60
161. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 54 of 60
162. (debark person43 plane1 city7)
   deleted: (in person43 plane1)
   added: (at person43 city7)
   goals met: 55 of 60
163. (debark person27 plane1 city7)
   deleted: (in person27 plane1)
   added: (at person27 city7)
   goals met: 56 of 60
164. (debark person20 plane1 city7)
   deleted: (in person20 plane1)
   added: (at person20 city7)
   goals met: 57 of 60
165. (fly plane1 city7 city9 fl1 fl0)
   deleted: (at_aircraft plane1 city7) (fuel-level plane1 fl1)
   added: (at_aircraft plane1 city9) (fuel-level plane1 fl0)
   goals met: 57 of 60
166. (debark person47 plane1 city9)
   deleted: (in person47 plane1)
   added: (at person47 city9)
   goals met: 58 of 60
167. (debark person41 plane1 city9)
   deleted: (in person41 plane1)
   added: (at person41 city9)
   goals met: 59 of 60
168. (debark person13 plane1 city9)
   deleted: (in person13 plane1)
   added: (at person13 city9)
   goals met: 60 of 60
